// 2015年10月26日 vue.js  1.0.0
// 我不知道当时尤雨溪的心情是什么样的，但从他发布版本时所带的格言可以看出，他心里一定很复杂
// 那句话是：
// “The fate of destruction is also the joy of rebirth.”
// 翻译成中文是：毁灭的命运，也是重生的喜悦

// 并且为1.0.0这个版本配备了一个代号，叫新世纪福音战士（Evangelion），
// 这是一部动画片的名字。事实上，Vue.js每一次比较大的版本发布，都会配一个动画片的名称作为代号





// 2016年10月1日，这一天是祖国的生日，但同时也是Vue.js 2.0发布的日子。Vue.js 2.0的代号叫攻壳机动队（Ghost in the Shell）
// 同时，这一次尤雨溪发布这个版本时所带的格言是：
// “Your effort to remain what you are is what limits you.”
// 翻译成中文是：保持本色的努力，也在限制你的发展


// 在开发Vue.js的整个过程中，它的定位发生了变化，一开始的定位是：“Just a view layer library”就是说，
// 最早的Vue.js只做视图层，没有路由，没有状态管理，也没有官方的构建工具，只有一个库，放在网页里就直接用。

// 后来，他发现Vue.js无法用在一些大型应用上，这样在开发不同大小的应用时，需要不停地切换框架以及思维模式。
// 尤雨溪希望有一个方案，有足够的灵活性，能够适应不同大小的应用需求。
// 所以，Vue.js就慢慢开始加入了一些官方的辅助工具，比如路由（Router）、状态管理方案（Vuex）和构建工具（vue-cli）等。
// 加入这些工具时，

// Vue.js始终维持着一个理念：“这个框架应该是渐进式的。”
// 这时Vue.js的定位是：The Progressive Framework
// 翻译成中文，就是渐进式框架。


// 所谓渐进式框架，就是把框架分层。
// 最核心的部分是视图层渲染，然后往外是组件机制，在这个基础上再加入路由机制，再加入状态管理，最外层是构建工具，